cases/openfoam.com/dakotaTeslaOneWayValve2D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:                                        |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2000;

deltaT          1;

writeControl    timeStep;

writeInterval   1000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    fluxDeltaInOut
    {
        type            multiFieldValue;
        libs            ( fieldFunctionObjects );

        operation       subtract;

        functions
        {
            fluxInlet
            {
                type        surfaceFieldValue;
                libs        ( fieldFunctionObjects );
                
                operation   sum;
                fields      (phi);
                regionType  patch;
                name        inlet;
                writeFields none;
                writeArea   false;
                postOperation mag;
            }
            fluxOutlet
            {
                type        surfaceFieldValue;
                libs        ( fieldFunctionObjects );
                
                operation   sum;
                fields      (phi);
                regionType  patch;
                name        outlet;
                writeFields none;
                writeArea   false;
                postOperation mag;
            }
        }
    }
}

// ************************************************************************* //
