cases/openfoam.com/dakotaTeslaOneWayValve2D/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:                                        |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        preconditioner  FDIC;
        tolerance       1e-10;
        relTol          0.1;
    }

    "(U|k|epsilon|R|nuTilda)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-08;
        relTol          0.1;
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors 0;
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;

    // Switch from SIMPLE to SIMPLEC algorithm
    consistent no;

    residualControl
    {
        p     1e-4;
        U     1e-5;
    }
}

relaxationFactors
{
    // Relaxation for SIMPLE algorithm
    fields
    {
        p               0.3;
    }
    equations
    {
        U               0.7;
        k               0.3;
        epsilon         0.3;
        R               0.3;
        nuTilda         0.3;
    }

    // Relaxation for SIMPLEC algorithm
    /*fields
    {
        // Not needed
        p               0.98;
    }
    equations
    {
        U               0.8;
        k               0.8;
        epsilon         0.8;
        R               0.8;
        nuTilda         0.8;
    }
    */
}


// ************************************************************************* //
