cases/openfoam.com/dakotaTeslaOneWayValve2D/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:                                        |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

regionSTL.stl
{
    // Extract raw features (none | extractFromFile | extractFromSurface)
    extractionMethod    extractFromSurface;

    // Mark edges whose adjacent surface normals are at an angle less
    // than includedAngle as features
    // - 0  : selects no edges
    // - 180: selects all edges
    includedAngle       150;

    // Do not mark region edges
    geometricTestOnly   yes;

    //  Needed especially for bad triangulations.
    //  Always check your feature edge mesh
    trimFeatures
    {
        //- Feature edges that contains less than 'minElem' of edges are
        //  removed automatically
        minElem 5;

        //- Remove feature edges that are less than the total length of [m]
        minLen  0.01;
    }

    // Generate additional intersection features (none | self | region)
    intersectionMethod  none;

    // Write features to obj format for postprocessing
    writeObj            yes;
}


// ************************************************************************* //
